Revit 2024 API
PanelScheduleData.UpdateCircuitTableForInstance Method
 Redraw the circuit table for the given panel with the given parameter updates
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void UpdateCircuitTableForInstance(
	FamilyInstance pPanel
)
Visual Basic
Public Sub UpdateCircuitTableForInstance ( _
	pPanel As FamilyInstance _
)
Visual C++
public:
void UpdateCircuitTableForInstance(
	FamilyInstance^ pPanel
)
Parameters
pPanel
Type: Autodesk.Revit.DB.FamilyInstance
 The panel that this circuit table is being drawn for
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace